[
	{
		"Post_id": 184045883409,
		"Date": "Mon, 08 Apr 2019 19:07:08",
		"Post_url": "https://hopoo.tumblr.com/post/184045883409/hopoo-games-development-thoughts-2",
		"Slug": "hopoo-games-development-thoughts-2",
		"Reblog_key": "iOIaRVHe",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Hopoo Games Development Thoughts #2",
		"content": "<p><br/>Hey! </p><p>With our first week of Early Access in the bag we thought we would share some more of our thoughts we have gathered over the week. We also want to thank everyone again for all of the support, emails, tweets, and feedback in such a short amount of time. Thank you all. </p><p>Similar to our first Developer Thoughts we wanted to break things down into Major and Minor Points, along with some things we have been working on.</p><h2>===Major Points===</h2><p>• We want to get our content roadmap available to users as soon as possible - we will be working on that this week.<br/>• Noting a LOT of people are dying very suddenly to blazing affixes and not enjoying it, and it will be tuned down. We do have concerns that the fire affix is artifically gating the difficulty and the game will be much easier once it&rsquo;s been normalized, but we will have to address that as it comes.<br/>• Noting people want a legitimate way to actively pursue lunar coins<br/>• Fighting Worm isn&rsquo;t fun, even though it is one of our higher effort bosses.<br/>• People have gotten far enough into the game that things just&hellip; stop spawning. For context, the game skips spawns that it deems is too easy for the number of &ldquo;spawn credits&rdquo; it has. If you&rsquo;ve gotten to that point congrats, the game thinks Overloading Worms are a bit too easy for you. This will naturally be fixed once higher tier monsters and affixes are added to the game. For now&hellip; it means that you terrified the whole planet.<br/>• Some players falling through the floor on level startup <br/>• Noting a large amount of players whose primary language isn&rsquo;t English who we want to support with localized text</p><h2>===Minor Points===</h2><p>• No one seems to notice Ice affix explosion on death<br/>• Some users are still getting really low performance, while some are not.<br/>• Prismatic Trials leaderboard change seems to be positive!<br/>• Noting a lot of concerns that characters will continually get nerfed in a PvE game<br/>• Engineer&rsquo;s weird dependency on Bustling Fungus to be viable has always been a concern for once we add more items - he will have a smaller percentage fungii in the pool. How will we make sure every item patch doesn&rsquo;t make Engi worse?<br/>• Noting the Mercenary sometimes launching Greater Wisps into space<br/>• MUL-T seems to have issues going up specific slopes with his lower speed<br/>• Noting players want the number of Stages Complete displayed on the HUD<br/>• Noting some Equipment are activating multiple times repeatedly over the network </p><h2>===Stuff we are working on===</h2><p>• Content/Early Access roadmap<br/>• Improving the way we save data to further prevent save file corruption or the game not saving at all<br/>• Players falling through the floor on entering a new stage<br/>• Wake of Vultures taking half your health<br/>• Improve MUL-T equipment swapping logic <br/>• Changing burning calculation<br/>• Improve the other elites (Ice, Lightning) to be threatening as well<br/>• Improve Worm fight to be fun<br/>• Changing the way some languages handle specific characters and fonts to make sure they are consistent<br/>• Some inconsistent proc coefficients for certain survivor abilities (Artificer is very very low for no reason)<br/>• Lots of bug fixes and quality of life improvements <br/>• Adding in some Community Suggestions we have gathered from tweets, emails, and the official Discord</p><p>Please let us know if we missed anything - there is lots more going on behind the scenes but we wanted to make sure we get some of this information shared with the community. Again, thank you all so much for the amazing first week. We are so excited for the future of RoR 2 and what&rsquo;s to come!   </p><p><i>-Hopoo Games Team</i></p>",
		"Tags":""
	},
	{
		"Post_id": 183824942129,
		"Date": "Sat, 30 Mar 2019 16:21:06",
		"Post_url": "https://hopoo.tumblr.com/post/183824942129/hopoo-games-development-thoughts-1",
		"Slug": "hopoo-games-development-thoughts-1",
		"Reblog_key": "bFTxRAWQ",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Hopoo Games Development Thoughts #1",
		"content": "<p>HOLYMOLY<br/>O<br/>L<br/>Y<br/>M<br/>O<br/>L<br/>Y</p><p>Uh, ok. First, I just wanted to say from the whole team how absolutely floored we are with the reception so far. I was personally hoping for something to match at least half of the original game: apparently we&rsquo;re doing a LOT better. It&rsquo;s absolutely surreal - thank you all again.</p><p>We want to make sure the community is aware we are listening and in touch, so for the format of this post and subsequent ones in the future I want to try something new. Consider Development Thoughts to be an honest brain dump of the team. Excuse us if it&rsquo;s a bit scattered in formatting.</p><figure class=\"tmblr-full\" data-orig-height=\"2037\" data-orig-width=\"3831\"><img src=\"https://64.media.tumblr.com/574bc8cc8b75c7a711668291090beed1/tumblr_inline_pp754bs4aT1rcwq50_540.png\" data-orig-height=\"2037\" data-orig-width=\"3831\"/></figure><p><b>===Major Points===</b></p><p>Overall, we&rsquo;re ecstatic with the gameplay of Risk of Rain 2. There are some crashes we are trying our best to address, especially on game boot-up.</p><p>A goal we are currently trying to figure out is the most appropriate Customer Support path going forward. We&rsquo;ve been helping players manually, but a lot of players are falling through the cracks. DMing people through Discord isn&rsquo;t the most efficient. Will update everyone with info once it comes.</p><p>Another goal is a general roadmap for the game: what does the future of Risk of Rain 2 look like? How frequent are patches, compared to Content Updates? Will they be major chunks of content or trickling in over time? What would the community feel would keep the game the most enjoyable throughout Early Access?</p><p>We have internally finished a patch to address a lot of initial feedback and critical bugs - it is in QA and hopefully available to everyone early next week.</p><p><b>===Minor Points===</b><br/>• Happy with progression rate for classes - a touch faster than intended but still OK<br/>• Happy with Rainstorm difficulty - haven&rsquo;t seen much of Monsoon content to know. Drizzle is very easy but also fine.<br/>• Pleasantly surprised with people saying performance is good - have to narrow down why it runs poorly on some high-end machines<br/>• Happy with in-run decision making (3D Printers, Mountain Shrine, Order Shrine, etc). Should try to brainstorm more big decision points like this..<br/>• Happy that new teleporter event rules don&rsquo;t seem upsetting to RoR1 players<br/>• Curious about content distribution - are players progressing through unlocks too fast? How long do the more difficult item unlocks take?<br/>• Very happy with secret progressions - players are finding it at the ideal rate<br/>• Noting lots of feedback about 4+ player lobbies. Have to consider best way forward - most likely would be a private game only option with a disclaimer.<br/>• Noting sometimes monsters get stuck behind a closed door on Wetland Aspect<br/>• Noting people like going fast<br/>• Noting a lot of Quickplay Lobbies have an insane time to launch of 4000+ seconds<br/>• Noting people like ruining their build with Shrine of Order or 3D printer<br/>• Noting people want to be able to automatically continue sprinting after rolling<br/>• Noting people don&rsquo;t enjoy getting blasted as soon as they enter a stage</p><p><b>===Stuff we are working on===</b><br/>• Corrupted save file preventing people from playing is very high priority to fix - this is addressed in the Monday patch.<br/>• Happy with (mostly) class balance outside of MUL-T being a tad too strong. I think it&rsquo;s worth noting here that we have a stat per attack called it&rsquo;s &ldquo;proc coefficient&rdquo;, and it essentially defines how strong or frequent procs happen on an on-hit basis. MUL-T&rsquo;s nailgun has a low proc coefficient per nail of 0.4 compared to most character&rsquo;s 1.0, so he isn&rsquo;t proccing stuff a ton faster than other characters. <br/>• Very happy with Discord community aspect, but may need management help as it grows.<br/>• Imp Boss is a bit grindy, same with Worm<br/>• Some concerns about cheaters in Prismatic Trial. Excited for when seed rolls over.<br/>• Hearing loud &amp; clear about Teleporter being hard to see - want to make it still an aspect of the game without it feeling like a mistake. Players are not really noticing the passive particles - will start with a soft approach first.</p><p>Please let us know if we missed anything - our brains are a little frazzled right now. Again, thank you all SO much for the amazing launch day, and an enormous shout out to Gearbox for their absolutely great support and efforts. Crazy.</p><p>-Hopoo Games Team</p>",
		"Tags":""
	},
	{
		"Post_id": 181928213669,
		"Date": "Fri, 11 Jan 2019 12:53:33",
		"Post_url": "https://hopoo.tumblr.com/post/181928213669/risk-of-rain-fan-mods",
		"Slug": "risk-of-rain-fan-mods",
		"Reblog_key": "g2SSG3BV",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Risk of Rain Fan Mods",
		"content": "<p>Hi!<br/><br/>Maybe you’ve heard about it, but there has been some rumbling about Risk of Rain 1 recently. Saturnyoshi, a big RoR1 fan, has recently released his version of the game that has mod support!<br/><br/>This is not an official release made by us, but it’s a <i>very </i>neat passion project that deserves some attention. <a href=\"https://rainfusion.ml/\">Go check it out!</a><br/></p>",
		"Tags":""
	},
	{
		"Post_id": 160490814584,
		"Date": "Tue, 09 May 2017 17:08:27",
		"Post_url": "https://hopoo.tumblr.com/post/160490814584/devblog-2-frequently-asked-questions",
		"Slug": "devblog-2-frequently-asked-questions",
		"Reblog_key": "mECUhEcq",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "DevBlog #2 - Frequently Asked Questions",
		"content": "<p>Hey! Thanks so much to all our fans for yesterday&rsquo;s wonderful response. We&rsquo;re glad that you&rsquo;re all excited for the game - we&rsquo;ll try our best to match the enthusiasm! Since we&rsquo;ve been receiving a lot of questions, we’ll actually just do two devblogs back to back and answer some of the more popular ones.<br/></p><p><b>Q:</b> How is the online multiplayer?<br/><b>A:</b> RoR2 was built from the ground up with networking in mind, and therefore it&rsquo;ll be a much smoother experience.</p><p><b>Q:</b> Will we still need to port-forward?<br/><b>A: </b>We can&rsquo;t say for sure until the functionality is done (working on it this week, actually) but it&rsquo;s a pretty good bet that port forwarding won&rsquo;t be necessary. We&rsquo;re striving for one-click connection via Steam.</p><p><b>Q: </b>Will all the characters be coming back?<br/><b>A: </b>No - we haven&rsquo;t decided on who&rsquo;s coming back yet. Some characters (Commando, Engineer, etc) will be back because they have cool gameplay, while some might also come back because they&rsquo;re fan favorites (HAN-D, Acrid maybe? If he works well enough in 3D.) A lot of abilities are being reworked so they work in 3d as well, so there may be some spiritual successor classes.</p><p>Note: The unified character system mentioned in the first post isn&rsquo;t a replacement for classes. There are some exciting things we&rsquo;d like to do with it this time around now that we have it, however. We&rsquo;ll talk more about it soon.</p><p><b>Q: </b>What engine is this being developed on?<br/><b>A:</b> It&rsquo;s being developed in Unity, which has been great to work with so far.<br/></p><p><b>Q:</b> What&rsquo;s the team size?<br/><b>A: </b>In office we have a team size of three, up from our previous of two (so its like a 50% bigger team!)</p><p><b>Q: </b>Is Chris coming back for the music?<br/><b>A: </b>Yes! We are very excited to be able to work with Chris again on the RoR2 OST. You can check out his twitter for all things music related: <a href=\"https://twitter.com/AstronautDown\">AstronautDown</a> </p><p><b>Q:</b> Will this run on my toaster?<br/><b>A: </b>It&rsquo;s pretty early in development so we&rsquo;re not sure what the real performance requirements of RoR2 will be like yet. We&rsquo;ll be doing our best to make sure it runs well on as many machines as we can.</p><p><b>Q:</b> Will it have split-screen co-op?<br/><b>A:</b> At this point in development we can&rsquo;t say for sure. Having said that, we would love to be able to bring split-screen back and we know a lot of fans really enjoy it - we just don&rsquo;t know how that works in Unity yet. From what I&rsquo;ve seen of other games, it seems like 4 player co-op might be too taxing for consoles, but 2 player is likely. </p><p><b>Q:</b> Will artifacts (Glass, Command, Spite, etc) be coming back?<br/><b>A:</b> Yes - We will be bringing back some fan favorite artifacts as well as experimenting with new ones that we think would work well in a 3D environment (fun balls may or may not already be in the game..) <br/></p><figure data-orig-height=\"182\" data-orig-width=\"168\"><img src=\"https://64.media.tumblr.com/e60de704d704cb63ca0d3d9513c429b6/tumblr_inline_oppekxtN4s1rcwq50_540.png\" data-orig-height=\"182\" data-orig-width=\"168\"/></figure>",
		"Tags":" riskofrain, gamedev, devblog"
	},
	{
		"Post_id": 171900977909,
		"Date": "Thu, 15 Mar 2018 12:26:56",
		"Post_url": "https://hopoo.tumblr.com/post/171900977909/deadbolt-qa",
		"Slug": "deadbolt-qa",
		"Reblog_key": "BcAc3lNJ",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "DEADBOLT Q&A",
		"content": "<p>I tried to answer every question as honestly as I could, so I hope this is a good read. If your question isn’t there, it’s either identical to another one asked or joined together with another question. Cheers!<br/></p><hr><p>Q: In total, how much time does the campaign of Deadbolt span? It’s hard to tell, what with it being infinite nighttime and all. </p><p>A: I would imagine a month-ish. It is implied that the Candles are doing some sort of investigative work between missions, which would surely take some time.<br/><br/> Q: Did you have any major inspirations for the visual design of DEADBOLT? <br/> A: John Wick is obviously the biggest one!<br/><br/> Q: What would hopoo do if someone made a game completely based and inspired from Deadbolt and its… Concept? (with permission and not) <br/> A: There’s no way DEADBOLT is that unique in settings or thematics – ultimately, you know what’s right and what’s wrong when you’re inspired by a work, and so will everyone else! If you feel obligated to ask for permission, maybe you’re not exploring enough original ideas? <br/><br/> Q: When will we get modding? if so could we get a simplified modding kit? Any plans for updating dedbort, even just the map editor? Feature for adding custom sprites, rotation tool, copypasta tool, just to name a few… <br/> A: So the thing with that is that the map editor is only half the equation – while the map editor may be writing stuff to files, it also has to be interpreted on the end by the DEADBOLT game itself. Therefore, adding features that aren’t supported in engine simply won’t work – it won’t know what youre talking about. While rotation is supported in the engine, it doesn’t know how to read that from the files, etc. I also am trying to avoid any legacy issues where old maps are required for old versions of DEADBOLT, or vice versa.<br/><br/> Q: When is deadbolt 2 coming with werewolves and mummies <br/> A: Werewolves aren’t undead you dingus. But mummies could be cool.</p><p>Q: Will the stuff that came with the release of Deadbolt on Play Station, will be added on PC? <br/> A: Nope, that was sorta our deal-sweetener for getting on the Sony consoles.<br/><br/> Q: Will we ever see expansion levels for Deadbolt or would we get Deadbolt 2 instead? <br/> A: DEADBOLT 2 maybe sometime <br/><br/></p><p>Q: Does Ibzan is gay? <br/> A: I haven’t really thought of the sexual orientation of any of the characters, and I definitely don’t want to pull a JK Rowling and retroactively assign them. So in terms of canon, that just hasn’t been explored.</p><p><br/> Q: Would you prefer deadbolt 2 to be in 3d and 2d? Would you do a sequel? <br/> A: DEADBOLT is probably the narrowest design space I’ve worked with – there’s no dodging, insta death, insta travel attacks. By the end I felt very stretched out in terms of enemy design, and for that alone I’d think 3D. But hey, I may also just hate 3D by the end of RoR2 so who knows :^). I’d love to do a sequel one day, most likely from the perspective of Ibzan. But who knows!<br/><br/> Q: Did Ibzan want to kill the Fire, or just try to reconcile with it? <br/> A: He just wanted to talk – but who knows what would’ve happened after the Fireplace rejected him?<br/><br/> Q: Would you be interested in going back to the world of deadbolt sometime in the future? I remember hearing somewhere a 3D concept would be interesting to work on. <br/> A: I wish I was talented or driven enough to write comics for it – I think DEADBOLT is more about the stories of individuals, compared to RoR who is a story of the universe. I wrote the Cassette Tapes to reflect that.<br/><br/> Q: Looking back, is there anything you’d change about Deadbolt? <br/> A: Hmmm… I just wish I somehow could expand more on the lore and gangs, and what their goals were. Gameplay-wise, it was a tad too short. I liked doing a few standard stages, and then a mix-up stage (sniper, trap, boss, etc) – maybe we could’ve fit in a few more rotations.<br/><br/> Q: What’s your favourite loadout? <br/> A: Death/Taxes and Flashbang, like a scrub.<br/><br/> Q: Would you ever be interested in restarting the asset suggestion thread <br/> A: I consider DEADBOLT to be done – as a 2 (now 3!) man team, we financially can’t do the games-as-a-service thing like most big companies can for smaller games like DEADBOLT. I also intended DEADBOLT to be a one-and-done thing as a contrast for Risk of Rain, which we updated for years after release. </p><p>=CONTROVERSIAL OPINION ALERT= I personally also think that EVERY game getting a bunch of DLCS and updates and patches for a long time is, in a way, exhausting as a player. I think it makes it hard to feel satisfied when you finished a game and it’s over and you feel completed in the journey, knowing it’s not ~technically~ over until the devs stop patching. I think it’s great for some games (mostly multiplayer-based ones), but some games you just gotta let… finish, on a good note. Semi-open ended endings are always unsatisfying, in my opinion, and so recently it just feels like you don’t ever <i>complete</i> a game. …On the flip side, we are planning on doing lots of post-launch support for RoR2 because it’s actually inline with our design goals, so don’t fret!<br/><br/> Q: Will bugs like Scythe not having a cover sprite or some enemies not having a falling sprite (which causes the game to crash) be fixed? <br/> A: Which enemies have been missing a falling sprite? They should be resorting to idle, not crashing. Bosses?<br/><br/> Q: Just wanted to say, you guys are my favorite games studio, hands down. Now for the question: Now that the Reaper has completed his task and is allowed to rest, what’s next? Is the Fireplace going to keep him resting for a while? Does our MC have another task to accomplish? <br/> A: The Fireplace has never let a reaper “rest” before - the reason he is allowed to rest is because Ibzan never got to, and the Fireplace is trying something different with you. This is unexplored territory for the both of them – presumably he just pets his cat and gets bored before getting back to work.<br/><br/> Q: What happens to everyone else in the afterlife? <br/> A: People who aren’t in the Place? Who knows, and who cares about boring happy afterlife 😊<br/><br/> Q: I had a question about the lore. There’s mentions of places outside the city, across the river Styx. What are they and what are they like? <br/> A: The Styx connects the other realms together, including (presumably) wherever the demons came from. This is explored lightly in one of the demon cassette tapes.<br/><br/> Q: Will you ever expand more on the world of deadbolt or are you 100% done with it at this point? <br/> A: Nope definitely not done, really wanna explore more one day<br/><br/> Q: What’s your office address? For post and stuff, maybe I want to send you a box full of A4 sheets of paper with a thousand hoopters on each. <br/> A: Maybe this is the paranoia in me but I’m not comfortable posting my address online – you can just tweet it at me a thousand times instead<br/><br/> Q: Did Ibzan think the flames would give warmth to the Dredged or was he just lying to them and using them for his own gain? <br/> A: He was lying to himself, but he did truly believe that this was going to work, because this (at the time, anyways) seemed like the only way out. Metaphor woawoawo<br/><br/> Q: Could you add some sorta DEADBOLT reference into RoR2?  Will the Reaper be playable in Risk of Rain 2 as a bonus?<br/> A: Definitely references happening in some form, but playable might be stretchin’ it a bit, especially since it’d be taking up the slot of some more in-universe secret character.<br/><br/> Q: How excited are for RoR2? <br/> A: Honestly very nervous for the reception, with very big shoes to fill as a sequel for RoR. I just hope people like it, and that we don’t get burnt on 3D because there’s so many possibilities in the future for our games in 3D.<br/><br/> Q: How are the Demons born? We know they’re made in birthing chambers, but then is it just like humans or is there anything specific needed for a demon to be born f.e. skeletons&gt;suicide, zombies&gt;overdose, etc. <br/> A: Demons aren’t undead and don’t naturally exist in the Place, which is why they have to be smuggled over – they exist in whatever version of hell is in the DEADBOLT universe, and are natural denizens of the underworld.<br/><br/> Q: was izban hot before he died? <br/> A: The hottest<br/><br/> Q: do all the nightclubs canonically have chris c. as the dj <br/> A: Yes<br/><br/> Q: I love Deadbolt very dearly and i’ve listened to its soundtrack (particularly “Now I Am Become Death”) more times than i can remember. What’s your favourite tune from Deadbolt ? <br/> A: Defunktorum or The Proverbial Dust Biters<br/><br/> Q: In the Hardmode Cassette Tape it talked about a Reaper that wasn`t the current Reaper that we play as in the Game. Was this Reaper Izban? Since in the tape, he talked about the fireplace as his friend and that could be why he wanted to go back to the fireplace through the portal at the end of the game, to revisit his friend. <br/> A: Yes yes and yes. This was most heavily implied in Ibzan’s “home”, which parallel yours.<br/><br/> Q: Will RoR2 still have opportunities to create silly messy builds like covering the screen in missiles or releasing an endless stream of Thqwibs? If so, how are you working to mitigate the performance impact of those crazy builds? <br/> A: Yep! Currently we have a system that detects the average particle count in a scene and slowly adds a chance non-important effects (like hitsparks or impacts) don’t ever spawn. This will at some point also involve turning off expensive effects and reducing particle LODs.<br/><br/> Q: I really love the attention to detail to the characters, environment, aesthetics and gameplay mechanics. Its themes on the criminal underworld and the supernatural give a unique identity in a high-octane/stealth pixel action game I have not seen before. Additionally what prompted or inspired you to make DEADBOLT in the first place? <br/> A: DEADBOLT in its entirety was supposed to be not-Risk of Rain. It’s a gorey, violent, moody singleplayer puzzle-stealth game. We were just burnt out from the Risk of Rain experience, and we also wanted to flex our design muscles a bit and show that hey, we’re not just a one-trick pony of gamedevelopment :^)<br/><br/> Q: I just played through this game on PS4/Vita over the weekend. Huge fan of Risk of Rain. Even bought it through Limited Run Games. So I had to pick up Deadbolt (Didn’t previously know you had made it either.) and I love it. Its a super solid experience. I’m not sure I have any questions about it. I guess I was curious if co-op multiplayer was ever considered in development? Keep up the great work. Can’t wait to see what you guys make next. <br/> A: Nope, because of the reasons above – we wanted a single player game, since RoR was a multiplayer one.<br/><br/> Q: First of all, congratulations!! I really loved the game since came out, I bought it for my birthday, since risk of rain made me fell in love with all the pixel art in it, deadbolt didn’t disappointed me!! Everything in it I love it! Thanks for the game!! Now the question You already answered about how the skeletons or vampires came to be in that Place, how the vampires are killed by their lovers, but, how a reaper, becomes to be a reaper? I mean a candle said “I’ve never been so close to one” <br/> A: Originally, the reapers were actually supposed to be from suicides – if I remember right, the reaper when going down the stairs to the docks still has the hole in the back of his head in his sprite. Currently, it’s not explored how a reaper is made – I think a bit of mystery is always needed in making a believable universe J<br/><br/> Q: Lorewise how many reapers are there total? Why are they incredibly fragile compared to the undead? What makes the reapers not undead? <br/> A: IIRC there were 4 fireplaces in the final stage, which was supposed to represent the way the fireplace was communicating to all reapers in the field.<br/><br/> Q: Do you like turtles? How about corgis? <br/> A: Yes, and yes (although there’s way too many in Seattle now).<br/><br/> Q: Did you have any idea Chris would break out a whole band’s worth of musicians for the soundtrack? His work was superb and the OST remains my absolute favorite to this day. <br/> A: DEADBOLT OST was actually done with many people – it must be in the credits somewhere! If I remember right, there is at least a drummer and a musician.<br/></p><p>Thanks for all the questions, and happy hunting :)</p><p style=\"\">hopoo<br/></p>",
		"Tags":" deadbolt"
	},
	{
		"Post_id": 168420591759,
		"Date": "Mon, 11 Dec 2017 01:21:39",
		"Post_url": "https://hopoo.tumblr.com/post/168420591759/this-blog-did-not-and-will-not-send-requests-for",
		"Slug": "this-blog-did-not-and-will-not-send-requests-for",
		"Reblog_key": "y0vqqke2",
		"Reblog_url": "https://godslush.tumblr.com/post/168412589357/this-blog-did-not-and-will-not-send-requests-for",
		"Reblog_name": "godslush",
		"Title": "",
		"content": "<p><a href=\"https://iron-thorn.tumblr.com/post/168397885916/this-blog-did-not-and-will-not-send-requests-for\" class=\"tumblr_blog\">iron-thorn</a>:</p><blockquote><h1>This blog did not and will not send requests for bitcoin donations. </h1><p>There seems to be a virus or some sort of malware going around causing blogs to “send out” chat messages to blogs that they follow asking for help with the purchase of certain items through donations of seemingly small amounts using bitcoin and adds a link to the message. </p><p>The message goes as following (at least the first message I got went like this): “Hi there buddy. I need help, I’m trying to buy a laptop and I can’t afford it. I’m about 0.36$ short, and I’d really appreciate if you could help me and transfer some money to me via bitcoin using this *link*.” </p><p>The small details in the message seems to have a few variations with the greeting, amount and purchased item showing up in different variations from formal to friendly, from 0.016 to 2$ and from a phone case to a laptop among others.</p><p>The blogs that are affected send out the messages to blogs that they follow for a long time mostly, so you are most likely to receive the message from a long time, active follower whose name you might recognize or a mutual etc. The blogs that are affected are not spam bots but actual active followers who follow the recipient for months or years and most likely the blogger who “sent” the message is unaware of the message being sent. </p><h1>DO NOT OPEN THE LINK.</h1><p>Opening up the link will cause the virus to spread even more and infect your computer/mobile with any sort of malware.</p><p>If you have received a message of that sort from this blog please know that it was not sent by me or within my control and ignore/delete the message without clicking the link.</p></blockquote>",
		"Tags": ""
	},
	{
		"Post_id": 168126418719,
		"Date": "Sat, 02 Dec 2017 17:56:33",
		"Post_url": "https://hopoo.tumblr.com/post/168126418719/ror2-qa-12217",
		"Slug": "ror2-qa-12217",
		"Reblog_key": "YVzSuYWm",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "RoR2 Q&A 12/2/17",
		"content": "<p>Since we got a million asks, I’ll collapse all the answers periodically into one giant QA so it doesn’t ruin your tumblr feed. I tried to answer every question - if yours isnt there, someone else might’ve asked the same question. Expand below to read!<br/></p><hr><p><b>Q:</b> Are you thinking about putting out a beta version to test or are you just waiting for the game to be fully released <br/><b>A:</b> Not sure exactly how we want to do it – we HAVE to have some way of getting the game out to testers, especially for networking/matchmaking testing. It will most likely be some form of closed/limited beta, but we really haven’t though too much about it.</p><p><b>Q:</b> Any ideas on what the system requirements could be? Will they be high or playable on most machines? Also will it work with integrated graphics? <br/><b>A:</b> Most likely the game will be pretty light for GPU with our graphical style, but CPU intensive. What that actually translates to won’t be until the game is closer to launch, where we start optimizing.</p><p><b>Q:</b> ROR1 most loved thing me and my friends liked to do is ruining the framerate with all the items that we had. we had lots of fun crashing the game for whoever hosted the game. might this still be able to happen? I&rsquo;m looking forward to the release anyway and so are my friends especialy with peer to peer now we can connect better. <br/><b>A:</b> Uhh hopefuly you won’t be able to crash the game, but the game will still scale infinitely like it did previously</p><p><b>Q:</b> Could you make it so that when you use Unstable Watch and timestop, all colors in the game become inverted for the duration? And if you want to go all the way with a certain reference, have only Chef&rsquo;s cleavers stop in midair at the edge of a radius from an enemy, and when the timestop ends the cleavers hit at the same time. <br/><b>A:</b> No memes</p><p><b>Q: </b>Super excites for risk of rain 2. Im real glad i found it in a steam summer sale, bought then and after that bought it for my ps4. Are we going to see any new characters? (Bandit will always be fav so as long as hes good im happy)<br/><b>A: </b>Yes, definitely new characters!</p><p><b>Q: </b>can you make one of the new death messages be &ldquo;HOST WHEN?&rdquo; <br/><b>A: </b>No memes!!!!</p><p><b>Q:</b> While Vita&rsquo;s out of the question, what about the Switch, which basically seems to have slotted itself in the &lsquo;more powerful handheld device&rsquo; niche? <br/><b>A: </b>We’d obviously love to be on the switch, but that ultimately depends on A. can we optimize the game to run on the Switch, and B. do we have the technical know-how to actually get it running? Porting to consoles tends to be a much more dramatic change than people expect, even if the engine natively exports to it.</p><p><b>Q: </b>Hi. I’ve been a fan of risk of rain for the past few years. I just want to ask: in risk of rain, some mechanics like heaven cracker can pierce a line of enemies and the huntress’ ability to hit and run. With the change from 2D to 3D  environment, how will they work? There are many other abilities and mechanics that i also want to ask about, but these two were the first ones that i could remember immediately.<br/><b>A: </b>We’re not going to bring back any mechanics that don’t fit just for the sake of continuity – however, the Heaven Cracker I can see being actually more fun in 3D since you have to actually align yourself with the enemies. Since everyone can shoot and run in the 3D version, Huntress’ niche is sorta gone, but we have some clever ideas to make that back</p><p><b>Q:</b> In DevBlog #8 you explain some of the steam integration going into Risk of Rain 2 which will make a lot of people happy but will RoR2 also be available without steam for those who prefer? For example will I be able to buy it on GOG like I did RoR1, and play LAN games without steam? <br/><b>A:</b> Right now we’re focusing on making it work via Steam P2P, but (I believe) that we haven’t done anything to explicity lock out connections via IP. You just won’t get the same Nat punchthrough benefits (I’ll have to ask Jeff, our network dude about it to make sure this is correct, but afaik I think that’s right)</p><p><b>Q:</b> Would you guys happen to have an idea of when you think the game would be realeased? <br/><b>A:</b> Nope! Hopefully not too long!</p><p><b>Q:</b> Hello! I loved Risk of Rain 1 and it is great to play with friends. I have two questions (technically three, I&rsquo;m cheating). 1. I am assuming you&rsquo;re going to release it on steam, so that said will there be steam multiplayer integration? Like&hellip; Invite via steam, games are created with the help of steam peer-to-peer. It was a pain to get 4 people playing on one server without port forwarding. 2. Will there be a better way to keep track of items? 3. Can you add a menu to see what items you have? <br/><b>A:</b> Yes, steam invites and all that are the goal. I know we talked about holding TAB to expand the item menu so you could see more at once, but we haven’t actually done that yet. I know it was a bit silly for it to be uncropped and expanding off the screen.</p><p><b>Q:</b> Is this still in development? <br/><b>A:</b> No we’re just pretending<br/></p><p><b>Q</b>: Are you gonna have the same soundtrack from the first game? A different soundtrack? A mix of both? (Don&rsquo;t get rid of the Dried Lake or Sunken Tombs songs). <br/><b>A:</b> That’ll ultimately be up to Chris, but I’m sure he’s in the same boat as us and doesn’t want to cover the same ground that we did previously. </p><p><b>Q:</b> I was telling a friend how excited I was for this, and he expressed a concern I’d like to ask you guys about. He said that, being 3D, the game might end up either not as hectic as the first, or too hectic, what with the hoards coming from all around you. What’s your take on this? (I’m not actually too worried about it, but I still wanna hear your take on the matter.)<br/><b>A:</b> Currently, we’re using SFX as a tool to present not only how close an enemy is, but what state they’re in and how many there are. Since I’ve also been playing the game for like a million hours I’ve also developed the ability to recognize which enemy by the frequency of their screenshake… but that won’t be relevant to most players. We’re really hoping to avoid radars or anything like that for awareness.</p><p><b>Q:</b> Just wanted to say, RoR2 is looking to be coming along fantastically. I really love that you are constantly taking things in unexpected directions&ndash; I never expected to see the game translated to 3D but you have done it and I can imagine many hundreds of hours spent playing. Will Chris Christodoulou be working on the music this game as well? <br/><b>A: </b>Yes, he will be back!</p><p><b>Q: </b>Have you considered calling the second Risk of Rain &ldquo;Risk of Twain&rdquo;? <br/><b>A:</b> Not until now</p><p><b>Q: </b>This is kind of a question and a half. How big will the RoR2 maps be and will all the RoR1 maps return in 3D with the additions of new maps or just overall new maps? <br/><b>A:</b> Overall we’re not really looking at the previous maps for the inspiration for our new ones – we’re not making RoR 3D, but a sequel, so we don’t really want to recreate too much old stuff!</p><p><b>Q: </b>Since RoR2 is moving to more dynamic network model, how will people with screwy NATs be affected? NAT Punchthrough is great and all, but if implemented incorrectly can lead to multiple users on the same NAT being unable to join servers outside of the NAT (See Rainbow Six Siege). Will users still be able to host dedicated servers like the old game? What does this mean for users buying the game through GOG/Humble Bundle? Really hope everything goes swimmingly because port forwarding sucks. <br/><b>A: </b>This is the exact reason that we will have to have some form of limited beta, because this is something that we can’t recreate in office. I honestly don’t know enough to respond accurately on what would happen in that particular situation, but thanks for the heads up</p><p><b>Q:</b> Relative to the first one, will Risk of Rain 2 be a sequel, prequel, completely unrelated, or even have story at all? <br/><b>A:</b> Sequel!</p><p><b>Q:</b> How were you going to implement artifacts this time around? Is it going to be based around areas that are randomly generated and you sometimes have access, or multiple spawn locations, etc. <br/><b>A:  </b>Dunno, we haven’t implemented really any form of map permutations yet. The artifacts also ended up taking a much more important role in the game than we initially expected – not sure if the old way of unlocking is strange if it’s to be a core feature.</p><p><b>Q:</b> (Big fan) I just had some curious questions; How many characters do you intend there to be in RoR2?, How differently do you plan on changing the previous characters?, Any hints on the final boss? pls, What is the estimated price of the game? and will their be any chance of PvP? Cannot wait, super hyped and keep up the great work :D <br/><b>A:</b> We’re aiming for 10 characters on launch. No spoilers or hints! Definitely not PvP in any official capacity since the networking structure wasn’t designed for a good PvP experience. </p><p><b>Q:</b> I&rsquo;ve got three questions : 1) Will it be called RoR2 or will you find / have you found something else ? 2) Why the hell is there one more 'o&rsquo; in the tumblr URL than in the actual 'Hopoo&rsquo; name ? 3) What&rsquo;s the average of the team&rsquo;s favorite meals ? thx xoxo &lt;3 <br/><b>A:</b> I think it’ll just be RoR2. The hopoo tumblr was taken on creation of this tumblr, so we had to make it hopooo instead ☹</p><p><b>Q:</b> Will RoR2 reveal why the Contact Light was carrying a teleporter linked to a planet crammed with hostile lifeforms? <br/><b>A: </b>I’d like to explore what the heck is up with the humans in this game, but I sorta wish I had a better avenue that’s not just item logs and monster logs. </p><p><b>Q:</b> I&rsquo;m going to ask the real questions, is Sniper a man or woman? This is important because reasons.<br/><b>A: </b></p><p><b>Q: </b>Theres something that confuses me alot about risk of rain 2. It&rsquo;s the lore. If the characters have left the planet, why would they come back? <br/><b>A:</b> Canonically, the returning characters were never on the Contact Light to begin with (and presumably there could totally be like, a bunch of engineers and commando suits.)</p>",
		"Tags":" riskofrain, gamedev"
	},
	{
		"Post_id": 126709779259,
		"Date": "Fri, 14 Aug 2015 21:06:37",
		"Post_url": "https://hopoo.tumblr.com/post/126709779259/anonymous-asks",
		"Slug": "anonymous-asks",
		"Reblog_key": "CsfyP6um",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Anonymous Asks",
		"content": "<p><b>Q:</b> Q1: Do you still make all your art in Paint? Q2: I&rsquo;m a programmer with very little art talent. I can make some pixel art in Photoshop, but it doesn&rsquo;t look all that great. Do you have any tips for beginners on how to get to a point to make art as nice as yours?<br/><b>A: </b>My drawings are all done in Paint, but animated in GraphicsGale (the layers + onion skinning comes useful. It comes surprising to hear that my art is nice; I was in the exact same position as you only a few years ago! I think looking at art that you like is the easiest way to learn pixel art; see how they choose color count, and how they use patterns to make shapes etc.<br/></p><p><br/><b>Q: </b>Are you planning on making deadbolt a pay to play game?<b><b><br/>A: </b></b>Yep, planning on selling it on Steam like RoR. Haven’t decided on a price point yet though<br/><b><b><br/><br/></b><b>Q: </b></b>Hi. Hope you&rsquo;re having a nice day. Where did you learn GML? Thanks for reading.<b><b><br/>A: </b></b>GameMaker tutorials and the GMC are good places to start. There’s a huge archive of questions probably similar to yours<br/><b><b><br/><br/></b><b>Q: </b></b>Did you choose the music that you did in that last video for Deadbolt because of John Wick? I&rsquo;m really digging it.<b><b><br/>A: </b></b>Whoops maybe<br/><b><b><br/><br/></b><b>Q: </b></b>How big is your work staff?<b><b><br/>A: </b></b>“Work staff” :&gt; Well I do all the development stuff outside of sfx and music which are contracted out<b><b><br/><br/><br/></b><b>Q: </b></b>Are you planning on Risk of Rain 2 or perhaps a prequel once you finish deadbolt? If so, would you be planning on mod support for the next game?<b><b><br/>A: </b></b>I really /do/ want mod support for future games, but GM essentially doesnt support it at all, so I’d have to hire a coder to code in a different engine, which might be too hard with our small (read: like 2) team size</p><p><br/></p><p><b><b>Q: </b></b>If a fan made a game with a similar playstyle to risk of rain, which item/character would you want them to reference?<b><b><br/>A: </b></b>Hmm.. HAN-D is probably my favorite design<b><b><br/><br/><br/></b></b><br/></p>",
		"Tags":""
	},
	{
		"Post_id": 87651638959,
		"Date": "Mon, 02 Jun 2014 21:35:35",
		"Post_url": "https://hopoo.tumblr.com/post/87651638959/the-game-is-still-very-touch-and-go-so-no-plans",
		"Slug": "the-game-is-still-very-touch-and-go-so-no-plans",
		"Reblog_key": "t0KVMNIY",
		"Reblog_url": "",
		"Reblog_name": "",
		"Title": "",
		"content": "<p><figure class=\"tmblr-full\" data-orig-height=\"643\" data-orig-width=\"500\" data-orig-src=\"https://64.media.tumblr.com/0b69c84805f0e0198d5546d31c43274f/tumblr_inline_n6kjukrFLO1rcwq50.png\"><img src=\"https://64.media.tumblr.com/27791bf8021269ffa07f83bf1e17a208/tumblr_inline_p8t00h068M1rcwq50_540.png\" data-orig-height=\"643\" data-orig-width=\"500\" data-orig-src=\"https://64.media.tumblr.com/0b69c84805f0e0198d5546d31c43274f/tumblr_inline_n6kjukrFLO1rcwq50.png\"/></figure></p><p>The game is still very touch-and-go, so no plans to where it heads. I&rsquo;d like to keep the game single-player; partially because of my incompetence in net coding, but also partially because you have to begin sacrificing elements to make a game multiplayer.<br/><br/>As for a kickstarter, probably not. I don&rsquo;t have a particular reason to do one, as funding is no longer an issue. While it <em>is</em> a convenient platform for pre-order rewards and publicity, it just wouldn&rsquo;t be very right to ask for money I don&rsquo;t need.<br/><br/>I&rsquo;ll post alphas once the game is in a decent state, just like I did for Risk of Rain. Any ideas for names?</p><p><a href=\"http://imgur.com/rVNstNZ\"><figure class=\"tmblr-full\" data-orig-height=\"421\" data-orig-width=\"712\" data-orig-src=\"http://i.imgur.com/rVNstNZ.gif\"><img src=\"https://64.media.tumblr.com/29cb20157846d201a55294f0ca6fcdd5/tumblr_inline_p8t00hsHkj1rcwq50_540.gif\" title=\"Hosted by imgur.com\" data-orig-height=\"421\" data-orig-width=\"712\" data-orig-src=\"http://i.imgur.com/rVNstNZ.gif\"/></figure></a></p><p><a href=\"http://imgur.com/fFmUf3a\"><figure class=\"tmblr-full\" data-orig-height=\"379\" data-orig-width=\"488\" data-orig-src=\"http://i.imgur.com/fFmUf3a.gif\"><img src=\"https://64.media.tumblr.com/e0e917425b1b91814e237d333242a47e/tumblr_inline_p8t00is4QS1rcwq50_540.gif\" title=\"Hosted by imgur.com\" data-orig-height=\"379\" data-orig-width=\"488\" data-orig-src=\"http://i.imgur.com/fFmUf3a.gif\"/></figure></a></p>",
		"Tags": "sprite, pixel art, gaming, indie, Necromancer"
	},
	{
		"Post_id": 84796649399,
		"Date": "Mon, 05 May 2014 00:30:00",
		"Post_url": "https://hopoo.tumblr.com/post/84796649399/accidentally-deleted-my-post-woops-this-is-for",
		"Slug": "accidentally-deleted-my-post-woops-this-is-for",
		"Reblog_key": "RLqL18O9",
		"Reblog_url": "",
		"Reblog_name": "",
		"Title": "",
		"content": "<p>Accidentally deleted my post, woops. This is for the Anon who sent me a message asking about how the Acrid walk animation looked.</p><p><a href=\"http://i.imgur.com/9CYTODG.png\">http://i.imgur.com/9CYTODG.png</a></p><p><a href=\"http://imgur.com/9CYTODG\"><img alt=\"image\" src=\"http://i.imgur.com/9CYTODG.png\" title=\"Hosted by imgur.com\"/></a></p>",
		"Tags": ""
	},
	{
		"Post_id": 79296783446,
		"Date": "Tue, 11 Mar 2014 17:46:00",
		"Post_url": "https://hopoo.tumblr.com/post/79296783446/hoopoe-hopoo-poopoo",
		"Slug": "hoopoe-hopoo-poopoo",
		"Reblog_key": "vdKcLhxu",
		"Reblog_url": "",
		"Reblog_name": "",
		"Title": "Hoopoe, Hopoo, Poopoo",
		"content": "<p><figure data-orig-height=\"197\" data-orig-width=\"170\" data-orig-src=\"https://64.media.tumblr.com/bd682f839133292a68182a981a9a6fab/tumblr_inline_n2ake5KzjQ1rcwq50.jpg\"><img alt=\"image\" src=\"https://64.media.tumblr.com/bd682f839133292a68182a981a9a6fab/tumblr_inline_pamn9r1LDL1rcwq50_540.jpg\" data-orig-height=\"197\" data-orig-width=\"170\" data-orig-src=\"https://64.media.tumblr.com/bd682f839133292a68182a981a9a6fab/tumblr_inline_n2ake5KzjQ1rcwq50.jpg\"/></figure></p><p><em>Figure 1: Hoopoe, a &ldquo;colourful bird that is found across Afro-Eurasia&rdquo;<br/></em></p><p><em><figure data-orig-height=\"204\" data-orig-width=\"171\" data-orig-src=\"https://64.media.tumblr.com/d15ea435c74f5221b7130601a16a0bda/tumblr_inline_n2akbrFDoO1rcwq50.png\"><img alt=\"image\" src=\"https://64.media.tumblr.com/d15ea435c74f5221b7130601a16a0bda/tumblr_inline_pamn9rT5Ke1rcwq50_540.png\" data-orig-height=\"204\" data-orig-width=\"171\" data-orig-src=\"https://64.media.tumblr.com/d15ea435c74f5221b7130601a16a0bda/tumblr_inline_n2akbrFDoO1rcwq50.png\"/></figure><br/></em></p><p><em>Figure 2: </em><em>Hopoo, a 20 year-old college student who bumbled his way into game development</em></p>",
		"Tags": "autocorrect, pixel"
	},
	{
		"Post_id": 78400345096,
		"Date": "Sun, 02 Mar 2014 22:53:18",
		"Post_url": "https://hopoo.tumblr.com/post/78400345096/summoning-animation",
		"Slug": "summoning-animation",
		"Reblog_key": "DneJ1AHg",
		"Reblog_url": "",
		"Reblog_name": "",
		"Title": "Summoning Animation",
		"content": "<p><a href=\"http://imgur.com/FtDbMGv\"><img src=\"http://i.imgur.com/FtDbMGv.gif\" title=\"Hosted by imgur.com\"/></a></p>",
		"Tags": "pixel, pixel art, gamedev, gaming"
	},
	{
		"Post_id": 77650210849,
		"Date": "Sun, 23 Feb 2014 20:03:06",
		"Post_url": "https://hopoo.tumblr.com/post/77650210849/okay-so-i-did-work-on-it-a-little",
		"Slug": "okay-so-i-did-work-on-it-a-little",
		"Reblog_key": "9RPjv43S",
		"Reblog_url": "",
		"Reblog_name": "",
		"Title": "",
		"content": "<p><a href=\"http://imgur.com/C0Lj8AP\"><img src=\"http://i.imgur.com/C0Lj8AP.gif\" title=\"Hosted by imgur.com\"/></a> &hellip;okay, so I did work on it a <em>little.</em></p>",
		"Tags": "pixel, pixel art, sprite, gamedev"
	},
	{
		"Post_id": 70771158822,
		"Date": "Sun, 22 Dec 2013 04:04:54",
		"Post_url": "https://hopoo.tumblr.com/post/70771158822/hostile-takeover-of-this-tumblr",
		"Slug": "hostile-takeover-of-this-tumblr",
		"Reblog_key": "hgk5SinT",
		"Reblog_url": "",
		"Reblog_name": "",
		"Title": "Hostile takeover of this tumblr",
		"content": "<p>Since working on Risk of Rain, I found that drawing pixel art can actually be pretty… <em>fun.</em></p><p>Because this tumblr no longer serves a use after launching our official Risk of Rain website, I&rsquo;ll now be using this tumblr to post pixel art and doodles while pretending I have an audience. </p>",
		"Tags": ""
	},
	{
		"Post_id": 47432081837,
		"Date": "Sun, 07 Apr 2013 23:59:40",
		"Post_url": "https://hopoo.tumblr.com/post/47432081837/kickstarter-now-submitted",
		"Slug": "kickstarter-now-submitted",
		"Reblog_key": "Uq19cqhf",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Kickstarter now submitted!",
		"content": "<p><strong>Finally</strong>, after much fighting with Amazon, our Kickstarter is submitted for verification! This should mean that<strong> after a few days of approval, our Kickstarter will be live.</strong></p>",
		"Tags":""
	},
	{
		"Post_id": 115179508669,
		"Date": "Tue, 31 Mar 2015 23:22:33",
		"Post_url": "https://hopoo.tumblr.com/post/115179508669/answering-some-questions-on-deadbolt",
		"Slug": "answering-some-questions-on-deadbolt",
		"Reblog_key": "G40kb5kX",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Answering some questions on Deadbolt",
		"content": "<p>Hey, got a sudden influx of asks, and a lot of them are the same, so here ya go.</p><p>Q: Will the game come out on Mac?</p><p>A: Most likely yes, that and Linux, seeing as GM exports to both. Probably not the alpha builds though, because I don’t easily have a Mac on hand</p><p>Q: Will the game be finished/when will it be updated?</p><p>A: Yes, the game will be finished! The current plan for development is similar to Risk of Rain’s; release early alpha builds on here, get a bunch of feedback, go into closed/private beta, and launch on Steam. I’ll update periodically when I need more feedback on stuff, since it kinda slows down development to tend builds</p><p>Q: Where can I follow the game?</p><p>A: Here is fine! I have a tigthread that I’m totally neglecting, but I’ll try to get better at updating all my random social media</p><p>Q: Kickstarter?</p><p>A: Nah, I got $$$ already B)<br/></p><p>Q: The game doesn’t fit on my screen!</p><p>A: Yeah, sorry :&lt; I admit I didn’t think I’d get really over 20 downloads on the build, let alone 22,000 (that took like 9 months for RoR to get that many), so right now it’s hard-coded to a resolution. Whoops!<br/></p>",
		"Tags":""
	},
	{
		"Post_id": 113098633634,
		"Date": "Sun, 08 Mar 2015 16:46:41",
		"Post_url": "https://hopoo.tumblr.com/post/113098633634/deadbolt-alpha-build",
		"Slug": "deadbolt-alpha-build",
		"Reblog_key": "cKPQF39L",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Deadbolt alpha build",
		"content": "<p>Aight, since some russian LP dude posted the link anyways, here&rsquo;s a rough demo for the first 5 stages of Deadbolt. I think it only runs on Windows, don&rsquo;t know about Wine. Everything is still a work in progress etc etc, but for anyone who&rsquo;s curious.<br/><br/>Anyways, try it out! Any feedback should be sent to my inbox on tumblr if possible<br/><a href=\"http://hopoo.itch.io/deadbolt\">http://hopoo.itch.io/deadbolt</a><br/></p>",
		"Tags":" gaming, deadbolt"
	},
	{
		"Post_id": 108224271669,
		"Date": "Thu, 15 Jan 2015 22:23:45",
		"Post_url": "https://hopoo.tumblr.com/post/108224271669/tig-thread",
		"Slug": "tig-thread",
		"Reblog_key": "t0bBBOmW",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "TIG Thread",
		"content": "<p>Started a thread on TIG, for anyone who would rather follow me there. It&rsquo;ll take a while to get accustomed back to the traditional forum format, but hey it has its benefits, and will also allow me to have a central location of dev logs for people interested<br/><br/><a href=\"http://forums.tigsource.com/index.php?topic=45642.0\">http://forums.tigsource.com/index.php?topic=45642.0</a></p>",
		"Tags":" gamedev, gaming, tig, tigsource"
	},
	{
		"Post_id": 108046627089,
		"Date": "Tue, 13 Jan 2015 23:04:38",
		"Post_url": "https://hopoo.tumblr.com/post/108046627089/strawpoll-for-game-name",
		"Slug": "strawpoll-for-game-name",
		"Reblog_key": "UpHBPwUw",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Strawpoll for game name",
		"content": "<p>Okay, narrowed it down to two names for <a href=\"http://hopooo.tumblr.com/post/107963427739/headless-zombie-dude-is-done-hes-considerably\">this game</a>. One was overwhelmingly better received, but I&rsquo;m trying to get as much feedback as possible. The option is between <strong>The Commission </strong>and <strong>Deadbolt</strong>. Please vote below!</p><p><a href=\"http://strawpoll.me/3402465\">http://strawpoll.me/3402465</a></p>",
		"Tags":""
	},
	{
		"Post_id": 99372878709,
		"Date": "Mon, 06 Oct 2014 22:57:30",
		"Post_url": "https://hopoo.tumblr.com/post/99372878709/while-ror-finishes-up-on-the-linuxmac-end-i",
		"Slug": "while-ror-finishes-up-on-the-linuxmac-end-i",
		"Reblog_key": "Pv2tQbyr",
		"Reblog_url": "",
		"Reblog_name": "",
		"Title": "",
		"content": "<p>While RoR finishes up on the Linux/Mac end, I started some progress on (what will probably become) my next project <em>sorry its not necrogame</em>. I wanted something very low-key while I finished college, so I&rsquo;m going for a game with smaller scope. I talked about the idea in a <a href=\"http://hopooo.tumblr.com/post/94998446214/more-game-ideas-yay-for-not-sleeping-plot-is-that\">previous blog</a></p><p>Any ideas for names?</p><p><br/><a href=\"http://imgur.com/Mj1RBvi\"><img src=\"http://i.imgur.com/Mj1RBvi.gif\" title=\"Hosted by imgur.com\"/></a> <a href=\"http://imgur.com/i96woyM\"><img src=\"http://i.imgur.com/i96woyM.gif\" title=\"Hosted by imgur.com\"/></a> <a href=\"http://imgur.com/b2cTJeI\"><img src=\"http://i.imgur.com/b2cTJeI.gif\" title=\"Hosted by imgur.com\"/></a> <a href=\"http://imgur.com/YycH3sP\"><img src=\"http://i.imgur.com/YycH3sP.gif\" title=\"Hosted by imgur.com\"/></a></p>",
		"Tags": "gamedev, gaming, sprite, pixel art, pixel, art"
	},
	{
		"Post_id": 44249332996,
		"Date": "Thu, 28 Feb 2013 18:20:13",
		"Post_url": "https://hopoo.tumblr.com/post/44249332996/more-questions",
		"Slug": "more-questions",
		"Reblog_key": "mRcMxKJe",
		"Reblog_url": "",
		"Reblog_name": "",
		"Title": "More questions",
		"content": "<p><strong>Q: </strong>Will this soon be able to update on its own<br/><strong>A: </strong>That would depend on our distribution platform. If we ever get on Steam, then it would be able to do so. We are looking at a few other platforms as well!</p><p><strong>Q: </strong>Awesome game so far! There is one balancing suggestion i have; it seems that a couple of the items, especially the missile launcher, becomes very OP once you have a couple of them. Also I&rsquo;d say the jet pack removes too much of the potential to be damaged once you have a few. Would you consider looking into nerfing these items a bit more to balance the late-game play?<br/><strong>A: </strong>I don&rsquo;t particularly mind there being a few &lsquo;op&rsquo; items because you have no control over what you choose. The reason the missile launcher hits so hard is because it only hits one enemy; later on, when theres a bunch of enemies at once, it isn&rsquo;t as useful except for against bosses, and I think that&rsquo;s okay! Jetpack should also be fine because it doesn&rsquo;t inherently give any defense or damage, just utility.</p><p><strong>Q: </strong>Hay, My Items Thing Isnty Working. I get an item and it doesnt unlock&hellip; I guess this is a bug report<br/><strong>A: </strong>Yep, its kind of buggy. Already fixed for next update.</p><p><strong>Q: </strong>The giant portal in the snow level must do something right? I wanted to find out. So I did this: http://imgur.com/0SXWupd   is what I got up too. And I dont think I can handle it any more. I’ve been at ‘Hahahah’ for ove 30 minutes. I give up.<br/><strong>A:</strong> Because the game is still in alpha, there is nothing past that level. Don&rsquo;t worry; once the game is closer to release, you&rsquo;ll know everything about it :-)</p><p><strong>Q: </strong>I want to applaud you for this game. Someone gave it to me on a USB and it has been spreading like wildfire at our school. Seriously, we haven&rsquo;t had an epidemic like this since CoD 1. Keep up the good work. -Your friend in Australia.<br/><strong>A:</strong> As someone who did the same thing (USB games) years ago I find that story very funny :-) Glad to hear we have fans all over the world.</p><p><strong>Q: </strong>Are there any new classes in the works? I personally love this game but I can see myself getting bored of it after playing the 2 characters a million times. Keep up the good work!<br/><strong>A: </strong>Absolutely!</p><p><strong>Q:</strong>Hey, love the game! I was wondering what you language / tool you created it with?<br/><strong>A:</strong>Gamemaker 8.0</p><p><strong>Q:</strong>There a glitch (I think its a glitch) where the game switches my control style to gamepad, even though I&rsquo;m using a keyboard. Easily fixed by setting the gamepad mode off, but a slight irritant that I thought I should bring up<br/><strong>A:</strong>Yes, its been fixed for next update. It happens when you go back to the menu using the ESC option from in-game.</p><p><strong>Q:</strong>I noticed that when you start off you always start off in Desolate forest is it always going to be like this or are you going to change which Levels you spawn in?<br/><strong>A:</strong>Thanks for asking! We will have multiple 'tiers&rsquo; of maps that the game will choose from, so you don&rsquo;t always play through the same maps every game.</p><p><strong>Q:</strong> I love this game so, so much.<br/><strong>A:</strong> :-)</p>",
		"Tags": ""
	},
	{
		"Post_id": 44071154316,
		"Date": "Tue, 26 Feb 2013 12:45:46",
		"Post_url": "https://hopoo.tumblr.com/post/44071154316/100-followers",
		"Slug": "100-followers",
		"Reblog_key": "Pa7Q5VCc",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "100+ Followers!",
		"content": "<p><figure data-orig-height=\"191\" data-orig-width=\"136\"><img src=\"https://64.media.tumblr.com/6140a3168dcb36df5ca947e7e6741ea8/5ca68462d3677ccd-c8/s540x810/d1274800ccebf0963e5e78b0ed4a1688e8007306.png\" data-orig-height=\"191\" data-orig-width=\"136\"/></figure><br/><br/><strong>We have hit over 100 followers! Thanks to all our fans for making it possible.</strong><strong><br/><br/>We also have a sudden influx of questions in our inbox, so here&rsquo;s some answers:<br/><br/>Q: </strong>Any plans on including multiplayer? That would be tits. <br/><strong>A:</strong> As tits as that would be, it would require re-working our entire game from the ground up, so we doubt any traditional online multiplayer will exist. We MIGHT be able to fudge in some kind of splitscreen/dual controller though!<br/><br/><strong>Q: </strong>Hey I have a problem when i first get on the the game the Resolution is too small to see. <br/><strong>A: </strong>You can change the scaling in the option (top right of the main screen, or hit ESC in-game)<br/><br/><strong>Q: </strong>I love the game but it would be much better if it had an upgrading system outside of the game, like every game you finish you gain exp based on highscore or something then you level up (on menu screen) then you get skill points/gold to buy skills such as when starting the game you get like 10 more health, up to 50 every skill level, and other stuff like 10% attack speed at maxed level, 10 damage at maxed level and so on, if you know what I mean, it would help a lot on hardcore mode. <br/><strong>A:</strong> We shy away from that because it would require grinding, and would make the game easier on subsequent playthroughs (which it already does by just becoming better at the game.) The need to feel like you are achieving something/making progress should be fulfilled when we start adding achievements to unlock items/classes/etc!<br/><br/><strong>Q: </strong>Will this be released on Mac at any point? I understand the key audience would be PC users but I&rsquo;d love to play it and (as my question should make obvious) I have a Mac <br/><strong>A:</strong> It is planned for Mac, yes. I don&rsquo;t quite know how stable GM for Mac is, but we hope for a playable Mac version around the time of our Kickstarter. We even got a Mac specifically to test a Mac build.<br/><br/><strong>Q: </strong>Will Risk of Rain be available for console (PSN to specific)? <br/><strong>A:</strong> Since GameMaker can&rsquo;t export to consoles, that probably won&rsquo;t happen :-(<br/><br/><strong>Q: </strong>Will there be CO-OP, Level Editors and possible mod support? <br/><strong>A:</strong> I don&rsquo;t know what kind of tools would be needed for modding. A level editor isn&rsquo;t on the list either (there are a lot of things on the list!) but would be really awesome to do.<br/><br/><strong>Q: </strong>I just had two bosses spawn after activating the teleporter on the first stage, is this supposed to happen sometimes? Amazing game btw, can&rsquo;t wait to see how this one grows, it&rsquo;s sure to be a cult classic. <br/><strong>A:</strong> Yep, multiple bosses can spawn depending on how far in you are. Bosses can be selected to spawn just like normal monsters can, they are just more &lsquo;expensive&rsquo;</p><p>Thank you everyone for all your support. Its very exciting to see our game develop a growing fanbase :-)</p>",
		"Tags":""
	},
	{
		"Post_id": 44012411953,
		"Date": "Mon, 25 Feb 2013 17:40:31",
		"Post_url": "https://hopoo.tumblr.com/post/44012411953/glovepie-script-play-with-a-wii-classic",
		"Slug": "glovepie-script-play-with-a-wii-classic",
		"Reblog_key": "IlDU1WPr",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Glovepie script - Play with a Wii Classic Controller.",
		"content": "<p>I used this yesterday to play with my wii classic controller instead of the keyboard. you may want to have a look at it.</p><p>To make this run you need to connect your wii controller to the computer with a bluetooth thingy, by using bluesoleil or anything else. Then you need to download glovepie, copy paste this script (<a href=\"http://pastebin.com/mSEg7LTS\">http://pastebin.com/mSEg7LTS</a>) click run, and you&rsquo;re set.</p>",
		"Tags":""
	},
	{
		"Post_id": 41818221726,
		"Date": "Tue, 29 Jan 2013 18:23:00",
		"Post_url": "https://hopoo.tumblr.com/post/41818221726/lots-of-questions-all-answers",
		"Slug": "lots-of-questions-all-answers",
		"Reblog_key": "jXM0xGiN",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Lots of Questions; All Answers.",
		"content": "<p>Q: Why dont you post in AGDG anymore? I heard you got banned or something&hellip; Just use tor, it will change your ip, and it worked for me! </p><p><br/> A: I was only banned for a few days, and have been busy with midterms lately to post any real progress. Don’t worry!</p><p><br/><br/> Q: Managed to get a solid playthrough of about 5-6 levels repeating the snow level several times, dying due to carelessness while trying to kill my third or fourth mass of Vagrants. For boss variety have you considered super versions of bosses instead of lots of one boss? As well as player sized bosses? Also the jellyfish doesn&rsquo;t really fit a snow level, have you considered a snow themed boss like a yeti? To sum it up, what are your plans regarding future bosses? </p><p><br/> A: The bosses do have ‘super’ versions in that they can spawn with affixes; did you see red, yellow, orange, and blue vagrants? If not, it may have been a glitch.<br/><br/> The snow level is far far from being finished; I plan on reintroducing at least one new boss every level, while cycling out the old ones from previous levels so it didn’t become stagnant. The snow level’s purpose in the latest build was to test how it felt; was it too large? Too empty? Too crowded?</p><p>Q: Will there be random quests?</p><p><br/> A: That is an interesting thought. I agree that there needs to be more risk/reward inside the game, and some kind of quest-ish option may be fun. What I don’t want is something like ‘Kill 10 Lizards: Receive 20 Exp.’ A quest may be more like a challenge that you have to accomplish in a short time, not a grind (especially in a time-based game like this.)</p><p><br/><br/> Q: Will there be unlock able characters or just skins?<br/><br/> A: Yes, there will be unlockable characters with all new skills. While during alpha testing they will be presented unlocked, in the game you will have to complete certain tasks to unlock them (for example, you will have to beat the entire game to unlock a new class.)<br/><br/></p><p><br/> Q: How many bosses/enemy variants will there be?<br/><br/></p><p>A: This is hard to answer! It really depends on how many we can fit; we want to make sure that every level feels different to another. I’m aiming for every level to have unique monsters but one; for example, level one and level two will only share one monster type. </p><p>I haven’t begun filling the game with content yet because we are ironing down all the gameplay mechanics, and going back and fixing old mechanics will be harder with ~20 monsters already included.<br/><br/><br/> Q: Kickstarter? Do you plan on including an enemy log? Preorders? Thank you, I really love this game so far.<br/><br/> A: A Kickstarter is a nice goal but ultimately farther along. As for preorders, we really don’t have any financial plans set in stone either. Not only that, but I would feel obligated to rush the game if I had a lot of preorders waiting, which would reduce the quality. It’ll be done when its done!<br/><br/> An enemy log is planned, very similar to the item log.<br/><br/> Thank you for all the question and interest in the game! If you have any more, please submit!<br/><br/></p>",
		"Tags":""
	},
	{
		"Post_id": 38857539030,
		"Date": "Wed, 26 Dec 2012 04:07:00",
		"Post_url": "https://hopoo.tumblr.com/post/38857539030/risk-of-rain-what-is-it",
		"Slug": "risk-of-rain-what-is-it",
		"Reblog_key": "lCljgusd",
		"Reblog_url":"",
		"Reblog_name":"",
		"Title": "Risk of Rain: What is it?",
		"content": "<p><br/>For those unfamilar with the roguelike(like) genre, it is characterized primarily by randomized gameplay and permanent death. <br/><br/>However, most players find the genre hard to jump into: it is usually exceedingly complex. Risk of Rain aims to revitalize the genre with stylized graphics and an intuitive gameplay scheme that teaches itself, rather then having to be taught.</p><p>The three main goals for our game are simple:<br/><br/> 1. Design a game that is randomly generated every play-through, to keep replayability high and fresh.<br/><br/> 2. Time = difficulty. The longer you play, the harder the game gets.<br/><br/>3. Be enjoyable, regardless of whether you win or lose.<br/><br/><img src=\"http://i47.tinypic.com/2462ft3.png\"/><br/><br/> Monster spawning, item spawning, even where you spawn in the map is randomly generated. No game will ever be the same as another. Playing more and completing challenges will unlock more content, thrown into the “pool” of random generation once players become comfortable. <br/><br/>More details will be upcoming! <br/><br/></p>",
		"Tags":""
	}
]